{
  "general": {
    "capTable": {
      "title": "Cap Table",
      "description": "A record of who owns the company and in what proportions. Used to understand control, dilution, and how exit proceeds would be shared."
    },
    "valuation": {
      "title": "Company Valuation",
      "description": "What the company is considered to be worth for funding or exit purposes. Valuation directly drives share price and investor ownership."
    },
    "sharePrice": {
      "title": "Share Price",
      "description": "The price of one share, typically calculated as valuation divided by total shares. Determines how much ownership an investor buys with their capital."
    },
    "fullyDiluted": {
      "title": "Fully Diluted Shares",
      "description": "The total shares that would exist if all options, convertibles, SAFEs, and other rights were exercised. Reflects the 'real' ownership picture investors care about."
    },
    "issuedShares": {
      "title": "Issued Shares",
      "description": "Shares that have actually been issued and are currently owned. Does not include potential future shares from options or convertibles."
    },
    "authorizedShares": {
      "title": "Authorised Shares",
      "description": "The maximum number of shares the company is legally allowed to issue. Creates headroom for future fundraising, ESOP grants, and conversions."
    }
  },
  "investors": {
    "investorType": {
      "title": "Investor Type",
      "description": "Categories of shareholders (Founders, Angels, VCs, Employees, Strategic). Different types may have different goals, rights, and return expectations."
    },
    "ownership": {
      "title": "Ownership Percentage",
      "description": "The investor’s share of the company, expressed as a percentage. Determines influence, dilution exposure, and exit value."
    },
    "proRataRights": {
      "title": "Pro-Rata Rights",
      "description": "Allows an investor to buy into future rounds to maintain their ownership percentage. Protects against dilution and is valuable in high-growth companies."
    },
    "totalInvested": {
      "title": "Total Invested",
      "description": "The total capital the investor has put into the company. Useful for comparing investment size to ownership, return, and participation."
    },
    "currentShares": {
      "title": "Current Shares",
      "description": "The number of shares currently owned, factoring in sales, transfers, or conversions. Used to calculate ownership percentage."
    },
    "exitedInvestor": {
      "title": "Exited Investor",
      "description": "An investor who has sold or transferred their entire position. They no longer participate in future returns or dilution."
    }
  },
  "rounds": {
    "fundingRound": {
      "title": "Funding Round",
      "description": "A capital raise event where new shares are issued to investors. Each round changes ownership, valuation, and dilution."
    },
    "preMoneyValuation": {
      "title": "Pre-Money Valuation",
      "description": "What the company is valued at immediately before new investment. Determines how much ownership new investors receive for their money."
    },
    "postMoneyValuation": {
      "title": "Post-Money Valuation",
      "description": "Valuation after new investment (Pre-Money + New Capital). Used to understand dilution and investor ownership after the round."
    },
    "amountRaised": {
      "title": "Amount Raised",
      "description": "The total capital raised in a round. Higher raises typically mean more dilution unless valuation rises accordingly."
    },
    "roundType": {
      "title": "Round Type",
      "description": "Describes the stage of funding (Pre-Seed, Seed, Series A/B/C, Bridge). Different stages signal different levels of risk and expected return."
    },
    "leadInvestor": {
      "title": "Lead Investor",
      "description": "The investor setting the terms and valuation of a round. Often receives negotiation advantages and board representation."
    },
    "pricePerShare": {
      "title": "Price Per Share",
      "description": "How much each new share costs in the round. Higher prices mean less dilution for the same raise amount."
    }
  },
  "shareClasses": {
    "shareClass": {
      "title": "Share Class",
      "description": "Different types of shares carry different economic or control rights. Investors typically hold preference shares; founders/employees hold ordinary."
    },
    "ordinary": {
      "title": "Ordinary Shares",
      "description": "Basic ownership shares with standard voting rights. Typically held by founders and employees; receive proceeds after preference shares."
    },
    "preference": {
      "title": "Preference Shares",
      "description": "Investor shares with enhanced rights such as liquidation preference or anti-dilution protection. Improve investor downside protection."
    },
    "option": {
      "title": "Options",
      "description": "Rights to purchase shares in the future at a set price. Common in employee compensation; represent future dilution to investors."
    },
    "performanceRights": {
      "title": "Performance Rights",
      "description": "Rights that convert into shares on meeting performance conditions. AUS-friendly structure for ESS schemes with no strike price."
    },
    "liquidationPreference": {
      "title": "Liquidation Preference",
      "description": "Gives preference shareholders priority in an exit. They get paid first before ordinary shareholders, reducing investor downside."
    }
  },
  "transactions": {
    "transactionType": {
      "title": "Transaction Type",
      "description": "Describes how shares change hands (Issue, Transfer, Exercise, Sale). Different types affect dilution and cap table differently."
    },
    "issue": {
      "title": "Share Issue",
      "description": "Creation of new shares, typically during fundraising or exercise. Increases total shares and dilutes existing holders."
    },
    "transfer": {
      "title": "Share Transfer",
      "description": "Movement of existing shares between parties. Does not change total shares; ownership shifts without dilution."
    },
    "exercise": {
      "title": "Option Exercise",
      "description": "Converts an option into a share by paying the strike price. Creates new shares and increases dilution."
    },
    "exercisePrice": {
      "title": "Exercise/Strike Price",
      "description": "The price paid to exercise an option. Higher strike prices reduce the economic value for employees and increase capital to the company."
    },
    "buyback": {
      "title": "Share Buyback",
      "description": "Company repurchases its own shares, reducing total shares. Can consolidate ownership or tidy employee exits."
    },
    "secondarySale": {
      "title": "Secondary Sale",
      "description": "Shares sold between investors. No new shares issued and the company does not receive funds."
    },
    "reequitization": {
      "title": "Re-equitization",
      "description": "Resetting employee equity (often options) after a valuation drop. Re-aligns incentives at the cost of dilution."
    }
  },
  "vesting": {
    "vesting": {
      "title": "Vesting",
      "description": "Shares become earned over time or milestones. Protects the company from issuing unearned equity and aligns incentives."
    },
    "cliff": {
      "title": "Cliff Period",
      "description": "An initial period where nothing vests. If someone leaves before the cliff, the company retains all unvested shares."
    },
    "vestingPeriod": {
      "title": "Vesting Period",
      "description": "The full schedule over which shares vest. Longer schedules align with long-term retention and value creation."
    },
    "acceleration": {
      "title": "Acceleration",
      "description": "Fast forwarding vesting due to an acquisition or termination. Impacts exit payouts and employee incentives."
    },
    "timeBased": {
      "title": "Time-Based Vesting",
      "description": "Shares vest based on time served. Standard for employees and founders; predictable and retention-focused."
    },
    "milestoneBased": {
      "title": "Milestone Vesting",
      "description": "Shares vest when targets are achieved. Aligns with measurable company performance and short-term value creation."
    },
    "hoursBased": {
      "title": "Hours-Based Vesting",
      "description": "Shares vest based on hours worked. Useful for part-time or advisory contributions where time commitment varies."
    },
    "hybridVesting": {
      "title": "Hybrid Vesting",
      "description": "Combines time, milestone, or hours-based vesting. Allows tailored incentive structures for key hires or founders."
    },
    "reverseVesting": {
      "title": "Reverse Vesting",
      "description": "Shares are issued upfront but subject to buyback if vesting conditions aren't met. Common for founders where value is created over time."
    },
    "goodLeaver": {
      "title": "Good Leaver",
      "description": "Leaving on friendly terms (retirement, redundancy, disability). Typically receives fairer treatment on vested equity."
    },
    "badLeaver": {
      "title": "Bad Leaver",
      "description": "Leaving on unfavourable terms (resignation or termination for cause). Usually forfeits unvested equity and may lose additional rights."
    },
    "lapsing": {
      "title": "Lapsing / Forfeiture",
      "description": "Unvested equity is cancelled and often returned to the ESOP pool. Reduces dilution for other holders and resets incentives."
    }
  },
  "convertibles": {
    "convertibleNote": {
      "title": "Convertible Note",
      "description": "A loan that turns into shares in a future round. Offers downside protection and exposure to upside, making it attractive for early investors."
    },
    "safe": {
      "title": "SAFE",
      "description": "Simple Agreement for Future Equity. Converts into shares in a later priced round without interest or maturity. Investor-friendly in high-growth scenarios."
    },
    "valuationCap": {
      "title": "Valuation Cap",
      "description": "The maximum valuation at which a convertible converts. Ensures early investors receive a better price than late-stage investors."
    },
    "discount": {
      "title": "Conversion Discount",
      "description": "A percentage discount applied to the share price on conversion. Rewards early risk-taking and improves investor return."
    },
    "maturityDate": {
      "title": "Maturity Date",
      "description": "When a convertible note must convert or be repaid. Forces a financing event and reduces investor uncertainty."
    },
    "qualifyingRound": {
      "title": "Qualifying Round",
      "description": "A funding event that triggers conversion. Ensures conversion happens only in meaningful priced rounds."
    },
    "conversionShares": {
      "title": "Estimated Conversion Shares",
      "description": "An estimate of how many shares a convertible will convert into. Helps investors model dilution and future ownership."
    }
  },
  "dilution": {
    "dilution": {
      "title": "Dilution",
      "description": "Ownership percentages decrease as new shares are issued. Dilution is not always negative if valuation increases faster than share count."
    },
    "antiDilution": {
      "title": "Anti-Dilution Protection",
      "description": "Investor rights that issue extra shares if a down round occurs. Protects investor ownership and return profile."
    },
    "downRound": {
      "title": "Down Round",
      "description": "A round priced lower than the previous one. Increases dilution for existing shareholders and often triggers anti-dilution or option repricing."
    },
    "proRataCalculation": {
      "title": "Pro-Rata Investment",
      "description": "The amount an investor must invest to keep their ownership percentage steady in a new round. Helps defend against dilution."
    }
  },
  "esop": {
    "esop": {
      "title": "ESOP / Option Pool",
      "description": "Shares reserved for employee equity compensation. Expanding the pool increases dilution but strengthens talent incentives."
    },
    "esopDilution": {
      "title": "ESOP Dilution Method",
      "description": "Describes whether the ESOP pool dilutes founders, new investors, or both. Often negotiated as part of funding terms."
    },
    "allocated": {
      "title": "Allocated Options",
      "description": "Options granted to employees. Represent committed dilution."
    },
    "unallocated": {
      "title": "Unallocated Pool",
      "description": "Options not yet granted. Future hiring and retention tool, and a source of expected dilution."
    },
    "poolExpansion": {
      "title": "Pool Expansion",
      "description": "Increasing ESOP size. Typically negotiated before a round and dilutes all holders unless otherwise structured."
    }
  },
  "tax": {
    "essTax": {
      "title": "ESS Tax Rules (Australia)",
      "description": "Rules governing how employee equity is taxed in Australia. Impacts the attractiveness of options and performance rights."
    },
    "startupConcession": {
      "title": "ESS Startup Concession",
      "description": "Tax concessions for eligible startups that defer tax on employee equity and reduce upfront burden. Important for early hiring."
    },
    "division83A": {
      "title": "Division 83A",
      "description": "The tax law section covering employee equity. Dictates taxing points and how heavily equity is taxed."
    },
    "taxingPoint": {
      "title": "Taxing Point",
      "description": "The moment equity becomes taxable (grant, vest, exercise, or sale). Influences employee preferences for options vs rights."
    }
  },
  "scenarios": {
    "exitWaterfall": {
      "title": "Exit Waterfall",
      "description": "Shows how exit proceeds are distributed among shareholders. Preference shares get paid first, then ordinary. Determines investor returns."
    },
    "dilutionCalculator": {
      "title": "Dilution Calculator",
      "description": "Models how ownership changes with new rounds. Helps investors evaluate how much share they lose versus value gained."
    },
    "roundSimulator": {
      "title": "Round Simulator",
      "description": "Simulates a future raise, including ESOP expansion and convertible conversions. Helps forecast valuation, dilution, and ownership."
    },
    "participatingPreferred": {
      "title": "Participating Preferred",
      "description": "Preference shares that get their preference paid first and then participate pro rata. Increases investor returns relative to ordinary."
    },
    "nonParticipatingPreferred": {
      "title": "Non-Participating Preferred",
      "description": "Preference shares that choose either their preference or pro rata participation. Balanced between investor protection and founder upside."
    }
  },
  "fields": {
    "companyName": {
      "title": "Company Name",
      "description": "Legal registered name of the company (Australia: ASIC registry)."
    },
    "investorName": {
      "title": "Investor Name",
      "description": "Name of the shareholder or investing entity. Used for ownership attribution and payout calculations."
    },
    "numberOfShares": {
      "title": "Number of Shares",
      "description": "Amount of shares associated with a holding or transaction. Used to calculate ownership and dilution."
    },
    "roundName": {
      "title": "Round Name",
      "description": "Label for a funding round (Seed, Series A). Helps track ownership over time."
    },
    "transactionDate": {
      "title": "Transaction Date",
      "description": "Date shares were issued, transferred, or cancelled. Important for valuation, vesting, and tax."
    },
    "vestingStartDate": {
      "title": "Vesting Start Date",
      "description": "When vesting begins. Impacts retention, tax treatment, and acceleration."
    },
    "cliffMonths": {
      "title": "Cliff (Months)",
      "description": "Months before vesting begins. Protects the company from early departures."
    },
    "vestingMonths": {
      "title": "Vesting Period (Months)",
      "description": "Total timeline for vesting to complete. Longer durations reduce turnover risk and align incentives."
    }
  }
}
